<script setup lang="ts"></script>

<template>
  <div class="container">
    <h1>“极狐助手”SAAS软件用户服务协议</h1>
    <div class="text-main">
      <p>协议版本：【1.0】；发布/生效日期：【2024年12月16日】</p>
      <p>欢迎您注册并使用“极狐助手”SAAS软件服务!</p>
      <p>
        本《“极狐助手”SAAS软件用户服务协议》(以下简称“本服务协议”)是您与极狐助手工作室(以下简称“我方”)之间就注册“极狐助手”SAAS软件用户账号及使用“极狐助手”SAAS软件的各项服务等相关事宜所订立的协议。为使用“极狐助手”SAAS软件的服务，您应当仔细阅读并遵守本服务协议下的全部内容，特别是涉及免除或者责任限制的条款，该类条款可能以黑体加粗或加下划线的形式提示您重点注意。除非您已阅读并接受本服务协议所有条款，否则您将不能注册并使用“极狐助手”SAAS软件服务，如您不同意本服务条款的任意内容，请勿注册或使用“极狐助手”SAAS软件服务，并应立即停止注册程序。如您对本服务协议的内容(特别是涉及免除或者责任限制的条款)有任何疑义，可随时按照本服务协议中列明的联系方式与我们联系，我们将根据您的要求为您进一步解释和说明相关内容。如您勾选“我同意《“极狐助手”SAAS软件用户服务协议》”并通过注册程序或其他任何方式使用或接受我方的任何服务，即视为您已阅读并同意本服务协议，自愿接受本服务协议的所有内容的约束。请您在决定注册或使用服务前再次确认您已知悉并完全理解本服务协议的所有内容。
      </p>
      <p>
        您知悉并承诺，您具有民事权利能力和民事行为能力，能够依法独立享有民事权利和承担民事义务的资格。若您不具备前述资格即注册并使用“极狐助手”SAAS软件服务的，则您及您的法定代表人应依照法律规定承担因此而导致的一切后果。
      </p>
      <p>
        本服务协议所述“服务”既包括您使用“极狐助手”SAAS软件接受我方所提供的服务，亦包括您代表您的品牌各门店(无论直营、联营、加盟)使用“极狐助手”SAAS软件。无论
        “服务”属于上述何种情形，本服务协议都将予以适用。
      </p>
      <p>一、协议相关</p>
      <p>【协议内容】本服务协议内容包括:</p>
      <p>(1) 本《“极狐助手”SAAS软件用户服务协议》</p>
      <p>
        (2)
        具体服务的服务条款:为更好地向您提供服务，我方针对具体的服务制定了专门的服务条款，供您与我方共同遵守，您在使用具体服务前，应仔细阅读该服务所适用的服务条款，您激活“极狐助手”SAAS软件账号并利用账号使用具体服务即表示您已同时接受该等服务条款，并将受该等服务条款的约束;
      </p>
      <p>
        上述各项内容之间如存在不一致之处，以时间上最新发布的内容为准，发布时间相同的，以本款【协议内容】中所包含的组成部分的序号倒序排列为准。
      </p>
      <p>【协议遵守】您理解并同意:</p>
      <p>
        (1)
        根据国家法律法规变化、运营需要或为提升服务质量的目的，我方在必要时对上述各项协议、条款与规则不时地进行修改更新，并通过合理、醒目的方式向您进行提前通知，上述修改更新内容将在相关更新说明中指定的日期开始实施，通常情况下不短于发布之日后八个自然日。
      </p>
      <p>
        (2)
        您应当及时查阅并了解相关更新修改内容，如您不同意相关更新修改内容，可停止使用相关更新修改内容所涉及的服务，此情形下，变更事项对您不产生效力;如您在上述
        更新修改内容实施后继续使用所涉及的服务，将视为您已同意各项更新修改内容。
      </p>
      <p>二、账号的注册</p>
      <p>
        【注册资料】您应遵循诚实信用、合法善意的原则，向我方提交相关注册资料，相关注册资料应当遵守法律法规、社会主义制度、国家利益、公民合法权益、公序良俗、信息真实等原则，不应提交任何违法或不良信息，相关资料如有变动，您应及时更新。如果因您所提供的注册资料不合法、不真实、不准确或未及时更新，从而导致相关法律责任或不利后果的，您将承担相应的法律责任及不利后果。
      </p>
      <p>
        【真实身份】因国家法律法规及监管要求，您需要在注册中填写真实的身份信息，如您填写的身份信息不完整、不真实将导致您无法使用服务、损害自身、他人利益或造成其他不利后果，该等后果将由您予以承担。
      </p>
      <p>【注册信息保护】我方将对您所提交的注册信息予以保护，不会将其披露给任何非关联的第三方，除非:</p>
      <p>(1) 相关法律法规或国家机关要求;</p>
      <p>(2) 我方发生相关合并、分立、收购或资产转移;</p>
      <p>(3) 或为提供相关服务所必须的</p>
      <p>三、账号的使用</p>
      <p>
        【账号使用】账号一经登录即视为我方已完成交付，并开始计算服务期限。您应对您账号项下的所有操作行为所产生的一切后果负责，通过您的账号所发生的所有操作行为将视为您
        本人的真实意思表示。如由于您自身原因导致账号被挪用、遗失造成的损失由您自行承担。
      </p>
      <p>
        【账号借用】为保证相关账号安全，您不应将“极狐助手”SAAS软件的账号借给他人使用，否则您应当承担由此产生的全部责任，我方保留拒绝提供相应服务、冻结或收回注册账
        号或终止本服务协议的权利，并可要求您对我方所承受的损失予以赔偿。
      </p>
      <p>
        【安全义务】如您发现账号存在安全问题，请您立即联系我方予以调查处理，否则我方对潜在损失的产生或扩大不承担任何责任。
      </p>
      <p>
        【限制冻结】您知悉并同意，在符合法律法规的规定，或经国家机关要求的前提下，我方有权对您的注册账号进行限制或冻结，在该等情况下，您可能无法继续登陆或使用您的注册账号。
      </p>
      <p>四、用户行为规范与责任承担</p>
      <p>
        【用户义务】您知悉并承诺，在使用“极狐助手”SAAS软件所提供的服务的过程中，您应遵守相关法律法规，不应从事如下违反法律法规的规定，影响正常服务提供或损害他人合法利益的行为:
      </p>
      <p>
        (1) 不应利用“极狐助手”SAAS软件服务危害国家安全、破坏政治稳定、泄露国
        家秘密，不侵犯国家、社会、集体利益和第三方的合法权益，不从事违法犯罪活动，不设立用
        于实施诈骗，传授犯罪方法，制作或者销售违禁物品、管制物品等违法犯罪活动的网站、通讯群组，不制作或者销售违禁物品、管制物品以及其他违法犯罪活动的信息;
      </p>
      <p>
        (2) 不应制作、发布、复制、查阅和传播、存储、链接下列信息:反对宪法所确定
        的基本原则的;危害国家安全，泄露国家秘密，颠覆国家政权，推翻社会主义制度，煽动分裂
        国家，破坏国家统一的;损害国家荣誉和利益的;煽动民族仇恨、民族歧视，破坏民族团结的;
        破坏国家宗教政策，宣扬邪教和封建迷信的;煽动非法集会、结社、游行、示威、聚众扰乱社会秩序的;捏造、散布谣言，侵犯他人权利，扰乱经济、社会秩序，破坏社会稳定的;散布淫
        秽、色情、赌博、暴力、凶杀、恐怖或者教唆犯罪的;侮辱或者诽谤他人，侵害他人合法权益
        的;宣扬恐怖主义、极端主义的;违背当地风俗习惯的;含有法律、行政法规禁止的其他内容的。
      </p>
      <p>
        (3) 不应从事下列危害计算机信息网络安全的活动:对网络服务及相关软硬件设施
        进行破解、破坏、删除、修改或者增加的;对计算机信息网络中存储或者传输的数据和应用程
        序进行删除、修改或者增加的;使用软件或硬件等方式窃取他人口令、非法入侵他人计算机系统;故意制作、传播计算机病毒等破坏性程序的;其他危害计算机信息网络安全的活动;
      </p>
      <p>
        (4) 不应擅自复制和使用网络上未公开和未授权的文件。除相关著作权人明示同意，
        不应在网络中擅自破解、传播、下载或复制第三人享有著作权的软件或进行其他任何侵害他人 知识产权的活动;
      </p>
      <p>
        (5) 不应私自传播广告信息或以“刷单”等不正当方式帮助他人提升评价或利用评 价权利对其他用户、商户实施威胁、敲诈勒索;
      </p>
      <p>(6) 不应因对“极狐助手”SAAS软件相关服务的使用行为导致我方卷入政治和 公共事件。</p>
      <p>
        【责任承担】如您在使用“极狐助手”SAAS软件服务过程中涉及上述行为中的一项或多
        项，则需要对自己的行为承担法律责任。承担法律责任的形式包括但不限于:对受到侵害者进行赔偿，以及在我方首先承担了因您的行为导致的行政处罚或侵权损害赔偿责任等损失(含
        诉讼费、律师费等相关法律程序费用)后，您应立即给予我方等额的赔偿。此外，根据具体
        违法违规情形，我方有权作出独立判断，立即暂停或终止对您提供部分或全部服务，包括锁
        定、注销、删除帐号等措施。同时，您同意，如因您的行为造成他人经济损失的，我方可出于公共利益保护、消费者保护、商业利益保护等原则，在合法合规的前提下，从您已支付的服务费用中划扣相应款项。
      </p>
      <p>
        您知悉并理解，如果我方发现您的上述违法违规行为，依据相关法律法规的规定，我方有权或有义务立即停止相关服务，进行调查取证，保存有关记录，或向国家有关机关举报。
      </p>
      <p>
        【安全使用】未经我方书面同意，您不得使用任何插件、外挂或第三方工具对本服务协议下的服务进行干扰、破坏、修改或施加其他影响。
      </p>
      <p>
        【信息采集】在使用“极狐助手”SAAS软件的过程中，您同意授权我方在服务期限内通过“极狐助手”SAAS软件采集您在外卖平台上产生的各项数据，您有权利在服务期限到期后的60个自然日内要求我方提供服务期限内的“极狐助手”SAAS软件上的数据库。
      </p>
      <p>
        【免责声明】“极狐助手”SAAS软件所提供的任何服务与功能均不构成对您的某项单一
        业务决策建议、投资决策建议，您应在相应服务与功能的基础上进行独立判断。
      </p>
      <p>五、知识产权</p>
      <p>
        【知识产权】您理解并知悉，除另有书面声明以外，以下信息和内容的知识产权(包括但
        不限于专利权、著作权、商标权及商业秘密)归我方所有:
      </p>
      <p>
        (1) 在“极狐助手”SAAS软件服务中所提供的内容和信息(包括但不限于软件、技术、
        程序、网页、文字、图片、图像、地图、图标、音频、视频、图表、版面设计、电子文档、数 据资料等);
      </p>
      <p>(2) 我方用于提供上述内容和信息的基础设施和平台;</p>
      <p>(3) 在我方提供相关服务中所使用的各项商标、商业形象、商业标识、技术诀窍、标语、文案等;</p>
      <p>(4) “极狐助手”SAAS软件服务的开发、运营、维护等过程中产生的所有数据和信息。</p>
      <p>
        “极狐助手”SAAS软件属于我方自行研发的分析系统，我方所拥有的上述权利及所提供服务中所包含的任何内容的知识产权均受到法律保护，未经我方书面许可，您承诺不应
        且不应允许或协助任何人以任何形式进行使用、出租、出借、分发、展示、复制、修改、链接、
        转载、汇编、发表、出版、抓取、监视、引用或创造相关衍生作品。
      </p>
      <p>
        【软件使用】在使用“极狐助手”SAAS软件的过程中，如果由于您未根据我方提供的产品说明规范操作而产生损失的，我方将不承担相应责任。为了改善用户体验、修复漏洞、
        保障安全性等考虑，我方有权对软件进行更新，您应该及时安装补丁或将相关软件更新至最
        新版本，我方将不保证您能正常使用相关软件。
      </p>
      <p>【软件使用禁止性规定】除非我方书面许可，您在使用“极狐助手”SAAS软件时不得从事下列任一行为:</p>
      <p>(1) 删除、编辑或遮挡软件及其副本上关于著作权、商标或其他权利标识或标记的信息;</p>
      <p>(2) 复制、发布、出售或出租软件或其任何部分;</p>
      <p>(3) 对软件进行反向工程、反向汇编、反向编译，或者以其他方式尝试挖掘、提取软件的源代码;</p>
      <p>
        (4)
        其他对软件、软件所产生的数据所进行的任何增加、删减、变动的任何行为，包含制作、利用、授权各种第三方外挂、插件、系统进行上述行为。
      </p>
      <p>六、协议的终止</p>
      <p>【协议终止情形】本服务协议于账号收回、注销之日终止;</p>
      <p>
        本服务协议终止后，我方将无法继续向您提供任何服务或履行任何其他义务，包括但不限于为您保留或向您披露原账号中的任何信息等。
      </p>
      <p>
        本服务协议的终止不影响第五条知识产权条款以及其他根据其内容应继续有效的条款的有效性，也不影响本服务协议终止前各方的相关权利和义务，包括但不限于守约方依据本服务协议向违约方追究相应的违约责任。
      </p>
      <p>七、通知与送达 您知悉并认可，我方可视情况通过下列任意一种或几种方式向您通知重要信息:</p>
      <p>(1) 向您注册时所提交的电子邮箱地址发送电子信息;</p>
      <p>(2) 向您注册时所提交的手机号码发送电子信息;</p>
      <p>(3) 向您提供的实际地址进行寄送纸质载体信息;</p>
      <p>
        上述电子信息在发送成功或刊登完成后即视为送达。相关纸质载体的发送以相关邮寄凭证上的邮寄日期后的第五个自然日视为送达。
      </p>
      <p>上述送达方式同样可适用于相关仲裁或司法程序(含起诉、审理、执行等各阶段)。</p>
      <p>
        您应当保证所提供的联系方式是准确、有效的，并进行适时更新，如因提供的联系方式不准确或怠于更新等不可归责于我方的原因，导致相关通知、文件、文书无法送达或及时送达，您将自行承担由此可能产生的法律后果。
      </p>
      <p>八、不可抗力或其他免责事由</p>
      <p>
        【不可抗力】您理解并同意，在使用本服务的过程中，可能会遇到不可抗力等风险因素，使本服务协议下的服务发生中断或终止。不可抗力是指不能预见、不能克服并不能避免且对一方或双方造成重大影响的客观事件，包括但不限于信息网络设备维护、信息网络连接故障、电
        脑、通讯或其他系统的故障、电力故障、罢工、劳动争议、暴乱、起义、骚乱、生产力或生产
        资料不足、火灾、洪水、风暴、爆炸、战争、政府行为、法律法规变动、司法行政机关的命令、其他不可抗力或第三方的不作为而造成的不能服务或延迟服务等行为。出现上述情况时，我方将努力在第一时间与相关部门配合，及时进行修复，但是由此给您造成的损失，我方在法律允许的范围内免责。
      </p>
      <p>【其他免责事由】您理解并同意，在法律允许的范围内，我方对以下事由所导致的服务中断或终止不承担责任:</p>
      <p>(1) 受到计算机病毒、木马或其他恶意程序、黑客攻击的破坏;</p>
      <p>(2) 您或外卖平台的电脑软件、系统、硬件和通信线路出现故障;</p>
      <p>(3) 您自身操作不当;</p>
      <p>(4) 其他我方无法控制或合理预见的情形。</p>
      <p>
        【信息真实性】我方不对非我方所发出或刊登的任何信息的真实性、适用性、合法性承担责任，也不对因第三方侵权行为给您造成的损害负责。
      </p>
      <p>九、管辖、法律适用与争议解决</p>
      <p>
        本服务协议的成立、生效、履行、解释与纠纷解决，适用中华人民共和国大陆地区法律法规，并且排除一切冲突法规定的适用。
      </p>
      <p>
        如因我方提供的服务问题导致您与我方出现纠纷，您同意，该等纠纷将由适用于该项具体服务的条款中所约定的争议解决地的有管辖权人民法院受理。
      </p>
      <p>十、其他</p>
      <p>
        【关键词】本服务协议各条款前所列关键词仅供帮助理解条款主旨及快速定位查询条款所用，不能代替条款的任何内容，亦不作为解释条款的依据，建议您仔细阅读各条款的具体表述，以维护您的合法权益。
      </p>
      <p>
        【可分性】如果本服务协议中任何一条被视为废止、无效或因任何理由不可执行，该条应视为可分的且并不影响任何其余条款的有效性和可执行性。
      </p>
      <p>如您对本服务协议有任何问题或建议，请在工作时间联系我方客服。</p>
      <p>再次感谢您的耐心阅读!</p>
    </div>
  </div>
</template>

<style scoped lang="scss">
body {
  font-family: Arial, sans-serif;
  line-height: 1.6;
  margin: 0;
  padding: 0;
  background-color: #f4f4f4;
}

.container {
  width: 80%;
  height: 100vh;
  margin: 0 auto;
  padding: 20px;
  background-color: #fff;
  box-shadow: 0 0 5px rgba(0, 0, 0, 0.1);
  overflow: scroll;
  box-sizing: border-box;
}

h1,
h2 {
  color: #333;
}

h1 {
  font-size: 24px;
  text-align: center;
  margin: 20px 0;
}

h2 {
  font-size: 20px;
  margin-top: 30px;
  margin-bottom: 15px;
}

p {
  margin-bottom: 15px;
}

ul,
ol {
  margin-bottom: 15px;
  padding-left: 20px;
}
</style>
